var eldi

console.log(eldi);
// 1: если мы сейчас попытаемся логировать переменую (eldi), то нам вернется (undefined); 
//Описание Директива let позволяет объявить локальную переменную с областью видимости, ограниченной текущим блоком кода . В отличие от ключевого слова var , которое объявляет переменную глобально или локально во всей функции, независимо от области блока.
// Только что мы создали новый идентификатор с именем ELDI. Когда в JavaScript создаётся переменная, она инициализируется со значением undefined. Если мы сейчас попытаемся логировать переменную Eldi, то нам вернётся undefined.

var eldi
function tina (){
    var kaif = new kaif()
return kaif
}
tina()
console.log(kaif) 
//Reference Error
// 2: В коде мы пытаемся получить доступ к переменой век функции,в которой она была обьявлена.
// Так как переменная (eldi) ограничена обласьтю видимосью фуннкции (tina), онп доступно 
// только внутри (kaif) или для любой вложеной в нее функции.

